/*************************************************************************
TPComp
E1.h  -  description
 -------------------
 début                : 15/02/2017
 copyright            : (C)2015 par APARICIO Christopher et HAIM Nathan
 *************************************************************************/

//---------- Interface de la classe E1 (fichier E1.h) ------
#if ! defined ( E1_H )
#define E1_H



//--------------------------------------------------- Interfaces utilisées
#include "etat.h"
//------------------------------------------------------------------------

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------------
// Role de la classe E1:
//

//------------------------------------------------------------------------

class E1 : public Etat {

    public:

        E1();
        
        virtual ~E1();

        bool transition(Automate & automate,Symbole *s);

};
#endif // if ! defined E1_H