/*************************************************************************
TPComp
E2.h  -  description
 -------------------
 début                : 15/02/2017
 copyright            : (C)2015 par APARICIO Christopher et HAIM Nathan
 *************************************************************************/

//---------- Interface de la classe E2 (fichier E2.h) ------
#if ! defined ( E2_H )
#define E2_H



//--------------------------------------------------- Interfaces utilisées
#include "etat.h"
//------------------------------------------------------------------------

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------------
// Role de la classe E2:
//

//------------------------------------------------------------------------

class E2 : public Etat {

    public:

        E2();
        
        virtual ~E2();

        bool transition(Automate & automate,Symbole *s);

};
#endif // if ! defined E2_H