/*************************************************************************
TPComp
E3.h  -  description
 -------------------
 début                : 15/02/2017
 copyright            : (C)2015 par APARICIO Christopher et HAIM Nathan
 *************************************************************************/

//---------- Interface de la classe E3 (fichier E3.h) ------
#if ! defined ( E3_H )
#define E3_H



//--------------------------------------------------- Interfaces utilisées
#include "etat.h"
//------------------------------------------------------------------------

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------------
// Role de la classe E3:
//

//------------------------------------------------------------------------

class E3 : public Etat {

    public:

        E3();
        
        virtual ~E3();

        bool transition(Automate & automate,Symbole *s);

};
#endif // if ! defined E3_H