/*************************************************************************
TPComp
E4.h  -  description
 -------------------
 début                : 15/02/2017
 copyright            : (C)2015 par APARICIO Christopher et HAIM Nathan
 *************************************************************************/

//---------- Interface de la classe E4 (fichier E4.h) ------
#if ! defined ( E4_H )
#define E4_H



//--------------------------------------------------- Interfaces utilisées
#include "etat.h"
//------------------------------------------------------------------------

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------------
// Role de la classe E4:
//

//------------------------------------------------------------------------

class E4 : public Etat {

    public:

        E4();
        
        virtual ~E4();

        bool transition(Automate & automate,Symbole *s);

};
#endif // if ! defined E4_H