/*************************************************************************
TPComp
E5.h  -  description
 -------------------
 début                : 15/02/2017
 copyright            : (C)2015 par APARICIO Christopher et HAIM Nathan
 *************************************************************************/

//---------- Interface de la classe E5 (fichier E5.h) ------
#if ! defined ( E5_H )
#define E5_H



//--------------------------------------------------- Interfaces utilisées
#include "etat.h"
//------------------------------------------------------------------------

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------------
// Role de la classe E5:
//

//------------------------------------------------------------------------

class E5 : public Etat {

    public:

        E5();
        
        virtual ~E5();

        bool transition(Automate & automate,Symbole *s);

};
#endif // if ! defined E5_H