/*************************************************************************
TPComp
E6.h  -  description
 -------------------
 début                : 15/02/2017
 copyright            : (C)2015 par APARICIO Christopher et HAIM Nathan
 *************************************************************************/

//---------- Interface de la classe E6 (fichier E6.h) ------
#if ! defined ( E6_H )
#define E6_H



//--------------------------------------------------- Interfaces utilisées
#include "etat.h"
//------------------------------------------------------------------------

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------------
// Role de la classe E6:
//

//------------------------------------------------------------------------

class E6 : public Etat {

    public:

        E6();
        
        virtual ~E6();

        bool transition(Automate & automate,Symbole *s);

};
#endif // if ! defined E6_H