/*************************************************************************
TPComp
E7.h  -  description
 -------------------
 début                : 15/02/2017
 copyright            : (C)2015 par APARICIO Christopher et HAIM Nathan
 *************************************************************************/

//---------- Interface de la classe E7 (fichier E7.h) ------
#if ! defined ( E7_H )
#define E7_H



//--------------------------------------------------- Interfaces utilisées
#include "etat.h"
//------------------------------------------------------------------------

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------------
// Role de la classe E7:
//

//------------------------------------------------------------------------

class E7 : public Etat {

    public:

        E7();
        
        virtual ~E7();

        bool transition(Automate & automate,Symbole *s);

};
#endif // if ! defined E7_H