/*************************************************************************
TPComp
E8.h  -  description
 -------------------
 début                : 15/02/2017
 copyright            : (C)2015 par APARICIO Christopher et HAIM Nathan
 *************************************************************************/

//---------- Interface de la classe E8 (fichier E8.h) ------
#if ! defined ( E8_H )
#define E8_H



//--------------------------------------------------- Interfaces utilisées
#include "etat.h"
//------------------------------------------------------------------------

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------------
// Role de la classe E8:
//

//------------------------------------------------------------------------

class E8 : public Etat {

    public:

        E8();
        
        virtual ~E8();

        bool transition(Automate & automate,Symbole *s);

};
#endif // if ! defined E8_H