/*************************************************************************
TPComp
E9.h  -  description
 -------------------
 début                : 15/02/2017
 copyright            : (C)2015 par APARICIO Christopher et HAIM Nathan
 *************************************************************************/

//---------- Interface de la classe E9 (fichier E9.h) ------
#if ! defined ( E9_H )
#define E9_H



//--------------------------------------------------- Interfaces utilisées
#include "etat.h"
//------------------------------------------------------------------------

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------------
// Role de la classe E9:
//

//------------------------------------------------------------------------

class E9 : public Etat {

    public:

        E9();
        
        virtual ~E9();

        bool transition(Automate & automate,Symbole *s);

};
#endif // if ! defined E9_H